zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_GFLTPO_C0_PS2_MASK               (0x4U)
#define VFCCU_3_GFLTPO_C0_PS2_SHIFT              (2U)
#define VFCCU_3_GFLTPO_C0_PS2_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS2(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS2_SHIFT)) & VFCCU_3_GFLTPO_C0_PS2_MASK)

#define VFCCU_3_GFLTPO_C0_PS3_MASK               (0x8U)
#define VFCCU_3_GFLTPO_C0_PS3_SHIFT              (3U)
#define VFCCU_3_GFLTPO_C0_PS3_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS3(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS3_SHIFT)) & VFCCU_3_GFLTPO_C0_PS3_MASK)

#define VFCCU_3_GFLTPO_C0_PS4_MASK               (0x10U)
#define VFCCU_3_GFLTPO_C0_PS4_SHIFT              (4U)
#define VFCCU_3_GFLTPO_C0_PS4_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS4(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS4_SHIFT)) & VFCCU_3_GFLTPO_C0_PS4_MASK)

#define VFCCU_3_GFLTPO_C0_PS5_MASK               (0x20U)
#define VFCCU_3_GFLTPO_C0_PS5_SHIFT              (5U)
#define VFCCU_3_GFLTPO_C0_PS5_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS5(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS5_SHIFT)) & VFCCU_3_GFLTPO_C0_PS5_MASK)

#define VFCCU_3_GFLTPO_C0_PS6_MASK               (0x40U)
#define VFCCU_3_GFLTPO_C0_PS6_SHIFT              (6U)
#define VFCCU_3_GFLTPO_C0_PS6_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS6(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS6_SHIFT)) & VFCCU_3_GFLTPO_C0_PS6_MASK)

#define VFCCU_3_GFLTPO_C0_PS7_MASK               (0x80U)
#define VFCCU_3_GFLTPO_C0_PS7_SHIFT              (7U)
#define VFCCU_3_GFLTPO_C0_PS7_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS7(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS7_SHIFT)) & VFCCU_3_GFLTPO_C0_PS7_MASK)

#define VFCCU_3_GFLTPO_C0_PS8_MASK               (0x100U)
#define VFCCU_3_GFLTPO_C0_PS8_SHIFT              (8U)
#define VFCCU_3_GFLTPO_C0_PS8_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS8(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS8_SHIFT)) & VFCCU_3_GFLTPO_C0_PS8_MASK)

#define VFCCU_3_GFLTPO_C0_PS9_MASK               (0x200U)
#define VFCCU_3_GFLTPO_C0_PS9_SHIFT              (9U)
#define VFCCU_3_GFLTPO_C0_PS9_WIDTH              (1U)
#define VFCCU_3_GFLTPO_C0_PS9(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS9_SHIFT)) & VFCCU_3_GFLTPO_C0_PS9_MASK)

#define VFCCU_3_GFLTPO_C0_PS10_MASK              (0x400U)
#define VFCCU_3_GFLTPO_C0_PS10_SHIFT             (10U)
#define VFCCU_3_GFLTPO_C0_PS10_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS10(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS10_SHIFT)) & VFCCU_3_GFLTPO_C0_PS10_MASK)

#define VFCCU_3_GFLTPO_C0_PS11_MASK              (0x800U)
#define VFCCU_3_GFLTPO_C0_PS11_SHIFT             (11U)
#define VFCCU_3_GFLTPO_C0_PS11_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS11(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS11_SHIFT)) & VFCCU_3_GFLTPO_C0_PS11_MASK)

#define VFCCU_3_GFLTPO_C0_PS12_MASK              (0x1000U)
#define VFCCU_3_GFLTPO_C0_PS12_SHIFT             (12U)
#define VFCCU_3_GFLTPO_C0_PS12_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS12(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS12_SHIFT)) & VFCCU_3_GFLTPO_C0_PS12_MASK)

#define VFCCU_3_GFLTPO_C0_PS13_MASK              (0x2000U)
#define VFCCU_3_GFLTPO_C0_PS13_SHIFT             (13U)
#define VFCCU_3_GFLTPO_C0_PS13_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS13(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS13_SHIFT)) & VFCCU_3_GFLTPO_C0_PS13_MASK)

#define VFCCU_3_GFLTPO_C0_PS14_MASK              (0x4000U)
#define VFCCU_3_GFLTPO_C0_PS14_SHIFT             (14U)
#define VFCCU_3_GFLTPO_C0_PS14_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS14(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS14_SHIFT)) & VFCCU_3_GFLTPO_C0_PS14_MASK)

#define VFCCU_3_GFLTPO_C0_PS15_MASK              (0x8000U)
#define VFCCU_3_GFLTPO_C0_PS15_SHIFT             (15U)
#define VFCCU_3_GFLTPO_C0_PS15_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS15(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS15_SHIFT)) & VFCCU_3_GFLTPO_C0_PS15_MASK)

#define VFCCU_3_GFLTPO_C0_PS16_MASK              (0x10000U)
#define VFCCU_3_GFLTPO_C0_PS16_SHIFT             (16U)
#define VFCCU_3_GFLTPO_C0_PS16_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS16(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS16_SHIFT)) & VFCCU_3_GFLTPO_C0_PS16_MASK)

#define VFCCU_3_GFLTPO_C0_PS17_MASK              (0x20000U)
#define VFCCU_3_GFLTPO_C0_PS17_SHIFT             (17U)
#define VFCCU_3_GFLTPO_C0_PS17_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS17(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS17_SHIFT)) & VFCCU_3_GFLTPO_C0_PS17_MASK)

#define VFCCU_3_GFLTPO_C0_PS18_MASK              (0x40000U)
#define VFCCU_3_GFLTPO_C0_PS18_SHIFT             (18U)
#define VFCCU_3_GFLTPO_C0_PS18_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS18(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS18_SHIFT)) & VFCCU_3_GFLTPO_C0_PS18_MASK)

#define VFCCU_3_GFLTPO_C0_PS19_MASK              (0x80000U)
#define VFCCU_3_GFLTPO_C0_PS19_SHIFT             (19U)
#define VFCCU_3_GFLTPO_C0_PS19_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS19(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS19_SHIFT)) & VFCCU_3_GFLTPO_C0_PS19_MASK)

#define VFCCU_3_GFLTPO_C0_PS20_MASK              (0x100000U)
#define VFCCU_3_GFLTPO_C0_PS20_SHIFT             (20U)
#define VFCCU_3_GFLTPO_C0_PS20_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS20(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS20_SHIFT)) & VFCCU_3_GFLTPO_C0_PS20_MASK)

#define VFCCU_3_GFLTPO_C0_PS21_MASK              (0x200000U)
#define VFCCU_3_GFLTPO_C0_PS21_SHIFT             (21U)
#define VFCCU_3_GFLTPO_C0_PS21_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS21(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS21_SHIFT)) & VFCCU_3_GFLTPO_C0_PS21_MASK)

#define VFCCU_3_GFLTPO_C0_PS22_MASK              (0x400000U)
#define VFCCU_3_GFLTPO_C0_PS22_SHIFT             (22U)
#define VFCCU_3_GFLTPO_C0_PS22_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS22(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS22_SHIFT)) & VFCCU_3_GFLTPO_C0_PS22_MASK)

#define VFCCU_3_GFLTPO_C0_PS23_MASK              (0x800000U)
#define VFCCU_3_GFLTPO_C0_PS23_SHIFT             (23U)
#define VFCCU_3_GFLTPO_C0_PS23_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS23(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS23_SHIFT)) & VFCCU_3_GFLTPO_C0_PS23_MASK)

#define VFCCU_3_GFLTPO_C0_PS24_MASK              (0x1000000U)
#define VFCCU_3_GFLTPO_C0_PS24_SHIFT             (24U)
#define VFCCU_3_GFLTPO_C0_PS24_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS24(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS24_SHIFT)) & VFCCU_3_GFLTPO_C0_PS24_MASK)

#define VFCCU_3_GFLTPO_C0_PS25_MASK              (0x2000000U)
#define VFCCU_3_GFLTPO_C0_PS25_SHIFT             (25U)
#define VFCCU_3_GFLTPO_C0_PS25_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS25(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS25_SHIFT)) & VFCCU_3_GFLTPO_C0_PS25_MASK)

