zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_GFLTPO_C0_PS26_MASK              (0x4000000U)
#define VFCCU_3_GFLTPO_C0_PS26_SHIFT             (26U)
#define VFCCU_3_GFLTPO_C0_PS26_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS26(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS26_SHIFT)) & VFCCU_3_GFLTPO_C0_PS26_MASK)

#define VFCCU_3_GFLTPO_C0_PS27_MASK              (0x8000000U)
#define VFCCU_3_GFLTPO_C0_PS27_SHIFT             (27U)
#define VFCCU_3_GFLTPO_C0_PS27_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS27(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS27_SHIFT)) & VFCCU_3_GFLTPO_C0_PS27_MASK)

#define VFCCU_3_GFLTPO_C0_PS28_MASK              (0x10000000U)
#define VFCCU_3_GFLTPO_C0_PS28_SHIFT             (28U)
#define VFCCU_3_GFLTPO_C0_PS28_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS28(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS28_SHIFT)) & VFCCU_3_GFLTPO_C0_PS28_MASK)

#define VFCCU_3_GFLTPO_C0_PS29_MASK              (0x20000000U)
#define VFCCU_3_GFLTPO_C0_PS29_SHIFT             (29U)
#define VFCCU_3_GFLTPO_C0_PS29_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS29(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS29_SHIFT)) & VFCCU_3_GFLTPO_C0_PS29_MASK)

#define VFCCU_3_GFLTPO_C0_PS30_MASK              (0x40000000U)
#define VFCCU_3_GFLTPO_C0_PS30_SHIFT             (30U)
#define VFCCU_3_GFLTPO_C0_PS30_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS30(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS30_SHIFT)) & VFCCU_3_GFLTPO_C0_PS30_MASK)

#define VFCCU_3_GFLTPO_C0_PS31_MASK              (0x80000000U)
#define VFCCU_3_GFLTPO_C0_PS31_SHIFT             (31U)
#define VFCCU_3_GFLTPO_C0_PS31_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C0_PS31(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C0_PS31_SHIFT)) & VFCCU_3_GFLTPO_C0_PS31_MASK)
/*! @} */

/*! @name GFLTPO_C1 - Global Fault Polarity */
/*! @{ */

#define VFCCU_3_GFLTPO_C1_PS32_MASK              (0x1U)
#define VFCCU_3_GFLTPO_C1_PS32_SHIFT             (0U)
#define VFCCU_3_GFLTPO_C1_PS32_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS32(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS32_SHIFT)) & VFCCU_3_GFLTPO_C1_PS32_MASK)

#define VFCCU_3_GFLTPO_C1_PS33_MASK              (0x2U)
#define VFCCU_3_GFLTPO_C1_PS33_SHIFT             (1U)
#define VFCCU_3_GFLTPO_C1_PS33_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS33(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS33_SHIFT)) & VFCCU_3_GFLTPO_C1_PS33_MASK)

#define VFCCU_3_GFLTPO_C1_PS34_MASK              (0x4U)
#define VFCCU_3_GFLTPO_C1_PS34_SHIFT             (2U)
#define VFCCU_3_GFLTPO_C1_PS34_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS34(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS34_SHIFT)) & VFCCU_3_GFLTPO_C1_PS34_MASK)

#define VFCCU_3_GFLTPO_C1_PS35_MASK              (0x8U)
#define VFCCU_3_GFLTPO_C1_PS35_SHIFT             (3U)
#define VFCCU_3_GFLTPO_C1_PS35_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS35(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS35_SHIFT)) & VFCCU_3_GFLTPO_C1_PS35_MASK)

#define VFCCU_3_GFLTPO_C1_PS36_MASK              (0x10U)
#define VFCCU_3_GFLTPO_C1_PS36_SHIFT             (4U)
#define VFCCU_3_GFLTPO_C1_PS36_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS36(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS36_SHIFT)) & VFCCU_3_GFLTPO_C1_PS36_MASK)

#define VFCCU_3_GFLTPO_C1_PS37_MASK              (0x20U)
#define VFCCU_3_GFLTPO_C1_PS37_SHIFT             (5U)
#define VFCCU_3_GFLTPO_C1_PS37_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS37(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS37_SHIFT)) & VFCCU_3_GFLTPO_C1_PS37_MASK)

#define VFCCU_3_GFLTPO_C1_PS38_MASK              (0x40U)
#define VFCCU_3_GFLTPO_C1_PS38_SHIFT             (6U)
#define VFCCU_3_GFLTPO_C1_PS38_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS38(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS38_SHIFT)) & VFCCU_3_GFLTPO_C1_PS38_MASK)

#define VFCCU_3_GFLTPO_C1_PS39_MASK              (0x80U)
#define VFCCU_3_GFLTPO_C1_PS39_SHIFT             (7U)
#define VFCCU_3_GFLTPO_C1_PS39_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS39(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS39_SHIFT)) & VFCCU_3_GFLTPO_C1_PS39_MASK)

#define VFCCU_3_GFLTPO_C1_PS40_MASK              (0x100U)
#define VFCCU_3_GFLTPO_C1_PS40_SHIFT             (8U)
#define VFCCU_3_GFLTPO_C1_PS40_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS40(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS40_SHIFT)) & VFCCU_3_GFLTPO_C1_PS40_MASK)

#define VFCCU_3_GFLTPO_C1_PS41_MASK              (0x200U)
#define VFCCU_3_GFLTPO_C1_PS41_SHIFT             (9U)
#define VFCCU_3_GFLTPO_C1_PS41_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS41(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS41_SHIFT)) & VFCCU_3_GFLTPO_C1_PS41_MASK)

#define VFCCU_3_GFLTPO_C1_PS42_MASK              (0x400U)
#define VFCCU_3_GFLTPO_C1_PS42_SHIFT             (10U)
#define VFCCU_3_GFLTPO_C1_PS42_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS42(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS42_SHIFT)) & VFCCU_3_GFLTPO_C1_PS42_MASK)

#define VFCCU_3_GFLTPO_C1_PS43_MASK              (0x800U)
#define VFCCU_3_GFLTPO_C1_PS43_SHIFT             (11U)
#define VFCCU_3_GFLTPO_C1_PS43_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS43(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS43_SHIFT)) & VFCCU_3_GFLTPO_C1_PS43_MASK)

#define VFCCU_3_GFLTPO_C1_PS44_MASK              (0x1000U)
#define VFCCU_3_GFLTPO_C1_PS44_SHIFT             (12U)
#define VFCCU_3_GFLTPO_C1_PS44_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS44(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS44_SHIFT)) & VFCCU_3_GFLTPO_C1_PS44_MASK)

#define VFCCU_3_GFLTPO_C1_PS45_MASK              (0x2000U)
#define VFCCU_3_GFLTPO_C1_PS45_SHIFT             (13U)
#define VFCCU_3_GFLTPO_C1_PS45_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS45(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS45_SHIFT)) & VFCCU_3_GFLTPO_C1_PS45_MASK)

