zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_GFLTPO_C1_PS46_MASK              (0x4000U)
#define VFCCU_3_GFLTPO_C1_PS46_SHIFT             (14U)
#define VFCCU_3_GFLTPO_C1_PS46_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS46(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS46_SHIFT)) & VFCCU_3_GFLTPO_C1_PS46_MASK)

#define VFCCU_3_GFLTPO_C1_PS47_MASK              (0x8000U)
#define VFCCU_3_GFLTPO_C1_PS47_SHIFT             (15U)
#define VFCCU_3_GFLTPO_C1_PS47_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS47(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS47_SHIFT)) & VFCCU_3_GFLTPO_C1_PS47_MASK)

#define VFCCU_3_GFLTPO_C1_PS48_MASK              (0x10000U)
#define VFCCU_3_GFLTPO_C1_PS48_SHIFT             (16U)
#define VFCCU_3_GFLTPO_C1_PS48_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS48(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS48_SHIFT)) & VFCCU_3_GFLTPO_C1_PS48_MASK)

#define VFCCU_3_GFLTPO_C1_PS49_MASK              (0x20000U)
#define VFCCU_3_GFLTPO_C1_PS49_SHIFT             (17U)
#define VFCCU_3_GFLTPO_C1_PS49_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS49(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS49_SHIFT)) & VFCCU_3_GFLTPO_C1_PS49_MASK)

#define VFCCU_3_GFLTPO_C1_PS50_MASK              (0x40000U)
#define VFCCU_3_GFLTPO_C1_PS50_SHIFT             (18U)
#define VFCCU_3_GFLTPO_C1_PS50_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS50(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS50_SHIFT)) & VFCCU_3_GFLTPO_C1_PS50_MASK)

#define VFCCU_3_GFLTPO_C1_PS51_MASK              (0x80000U)
#define VFCCU_3_GFLTPO_C1_PS51_SHIFT             (19U)
#define VFCCU_3_GFLTPO_C1_PS51_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS51(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS51_SHIFT)) & VFCCU_3_GFLTPO_C1_PS51_MASK)

#define VFCCU_3_GFLTPO_C1_PS52_MASK              (0x100000U)
#define VFCCU_3_GFLTPO_C1_PS52_SHIFT             (20U)
#define VFCCU_3_GFLTPO_C1_PS52_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS52(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS52_SHIFT)) & VFCCU_3_GFLTPO_C1_PS52_MASK)

#define VFCCU_3_GFLTPO_C1_PS53_MASK              (0x200000U)
#define VFCCU_3_GFLTPO_C1_PS53_SHIFT             (21U)
#define VFCCU_3_GFLTPO_C1_PS53_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS53(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS53_SHIFT)) & VFCCU_3_GFLTPO_C1_PS53_MASK)

#define VFCCU_3_GFLTPO_C1_PS54_MASK              (0x400000U)
#define VFCCU_3_GFLTPO_C1_PS54_SHIFT             (22U)
#define VFCCU_3_GFLTPO_C1_PS54_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS54(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS54_SHIFT)) & VFCCU_3_GFLTPO_C1_PS54_MASK)

#define VFCCU_3_GFLTPO_C1_PS55_MASK              (0x800000U)
#define VFCCU_3_GFLTPO_C1_PS55_SHIFT             (23U)
#define VFCCU_3_GFLTPO_C1_PS55_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS55(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS55_SHIFT)) & VFCCU_3_GFLTPO_C1_PS55_MASK)

#define VFCCU_3_GFLTPO_C1_PS56_MASK              (0x1000000U)
#define VFCCU_3_GFLTPO_C1_PS56_SHIFT             (24U)
#define VFCCU_3_GFLTPO_C1_PS56_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS56(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS56_SHIFT)) & VFCCU_3_GFLTPO_C1_PS56_MASK)

#define VFCCU_3_GFLTPO_C1_PS57_MASK              (0x2000000U)
#define VFCCU_3_GFLTPO_C1_PS57_SHIFT             (25U)
#define VFCCU_3_GFLTPO_C1_PS57_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS57(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS57_SHIFT)) & VFCCU_3_GFLTPO_C1_PS57_MASK)

#define VFCCU_3_GFLTPO_C1_PS58_MASK              (0x4000000U)
#define VFCCU_3_GFLTPO_C1_PS58_SHIFT             (26U)
#define VFCCU_3_GFLTPO_C1_PS58_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS58(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS58_SHIFT)) & VFCCU_3_GFLTPO_C1_PS58_MASK)

#define VFCCU_3_GFLTPO_C1_PS59_MASK              (0x8000000U)
#define VFCCU_3_GFLTPO_C1_PS59_SHIFT             (27U)
#define VFCCU_3_GFLTPO_C1_PS59_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS59(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS59_SHIFT)) & VFCCU_3_GFLTPO_C1_PS59_MASK)

#define VFCCU_3_GFLTPO_C1_PS60_MASK              (0x10000000U)
#define VFCCU_3_GFLTPO_C1_PS60_SHIFT             (28U)
#define VFCCU_3_GFLTPO_C1_PS60_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS60(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS60_SHIFT)) & VFCCU_3_GFLTPO_C1_PS60_MASK)

#define VFCCU_3_GFLTPO_C1_PS61_MASK              (0x20000000U)
#define VFCCU_3_GFLTPO_C1_PS61_SHIFT             (29U)
#define VFCCU_3_GFLTPO_C1_PS61_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS61(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS61_SHIFT)) & VFCCU_3_GFLTPO_C1_PS61_MASK)

#define VFCCU_3_GFLTPO_C1_PS62_MASK              (0x40000000U)
#define VFCCU_3_GFLTPO_C1_PS62_SHIFT             (30U)
#define VFCCU_3_GFLTPO_C1_PS62_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS62(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS62_SHIFT)) & VFCCU_3_GFLTPO_C1_PS62_MASK)

#define VFCCU_3_GFLTPO_C1_PS63_MASK              (0x80000000U)
#define VFCCU_3_GFLTPO_C1_PS63_SHIFT             (31U)
#define VFCCU_3_GFLTPO_C1_PS63_WIDTH             (1U)
#define VFCCU_3_GFLTPO_C1_PS63(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTPO_C1_PS63_SHIFT)) & VFCCU_3_GFLTPO_C1_PS63_MASK)
/*! @} */

/*! @name GFLTRC_C0 - Global Fault Recovery */
/*! @{ */

#define VFCCU_3_GFLTRC_C0_RHWSW0_MASK            (0x1U)
#define VFCCU_3_GFLTRC_C0_RHWSW0_SHIFT           (0U)
#define VFCCU_3_GFLTRC_C0_RHWSW0_WIDTH           (1U)
#define VFCCU_3_GFLTRC_C0_RHWSW0(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTRC_C0_RHWSW0_SHIFT)) & VFCCU_3_GFLTRC_C0_RHWSW0_MASK)

#define VFCCU_3_GFLTRC_C0_RHWSW1_MASK            (0x2U)
#define VFCCU_3_GFLTRC_C0_RHWSW1_SHIFT           (1U)
#define VFCCU_3_GFLTRC_C0_RHWSW1_WIDTH           (1U)
#define VFCCU_3_GFLTRC_C0_RHWSW1(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTRC_C0_RHWSW1_SHIFT)) & VFCCU_3_GFLTRC_C0_RHWSW1_MASK)

