zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_GFLTRC_C1_RHWSW60_MASK           (0x10000000U)
#define VFCCU_3_GFLTRC_C1_RHWSW60_SHIFT          (28U)
#define VFCCU_3_GFLTRC_C1_RHWSW60_WIDTH          (1U)
#define VFCCU_3_GFLTRC_C1_RHWSW60(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTRC_C1_RHWSW60_SHIFT)) & VFCCU_3_GFLTRC_C1_RHWSW60_MASK)

#define VFCCU_3_GFLTRC_C1_RHWSW61_MASK           (0x20000000U)
#define VFCCU_3_GFLTRC_C1_RHWSW61_SHIFT          (29U)
#define VFCCU_3_GFLTRC_C1_RHWSW61_WIDTH          (1U)
#define VFCCU_3_GFLTRC_C1_RHWSW61(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTRC_C1_RHWSW61_SHIFT)) & VFCCU_3_GFLTRC_C1_RHWSW61_MASK)

#define VFCCU_3_GFLTRC_C1_RHWSW62_MASK           (0x40000000U)
#define VFCCU_3_GFLTRC_C1_RHWSW62_SHIFT          (30U)
#define VFCCU_3_GFLTRC_C1_RHWSW62_WIDTH          (1U)
#define VFCCU_3_GFLTRC_C1_RHWSW62(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTRC_C1_RHWSW62_SHIFT)) & VFCCU_3_GFLTRC_C1_RHWSW62_MASK)

#define VFCCU_3_GFLTRC_C1_RHWSW63_MASK           (0x80000000U)
#define VFCCU_3_GFLTRC_C1_RHWSW63_SHIFT          (31U)
#define VFCCU_3_GFLTRC_C1_RHWSW63_WIDTH          (1U)
#define VFCCU_3_GFLTRC_C1_RHWSW63(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GFLTRC_C1_RHWSW63_SHIFT)) & VFCCU_3_GFLTRC_C1_RHWSW63_MASK)
/*! @} */

/*! @name GINTOVFS - Global DID FSM Status */
/*! @{ */

#define VFCCU_3_GINTOVFS_FLTSERV_MASK            (0x80U)
#define VFCCU_3_GINTOVFS_FLTSERV_SHIFT           (7U)
#define VFCCU_3_GINTOVFS_FLTSERV_WIDTH           (1U)
#define VFCCU_3_GINTOVFS_FLTSERV(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GINTOVFS_FLTSERV_SHIFT)) & VFCCU_3_GINTOVFS_FLTSERV_MASK)

#define VFCCU_3_GINTOVFS_SERV_DID_MASK           (0xF0000U)
#define VFCCU_3_GINTOVFS_SERV_DID_SHIFT          (16U)
#define VFCCU_3_GINTOVFS_SERV_DID_WIDTH          (4U)
#define VFCCU_3_GINTOVFS_SERV_DID(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GINTOVFS_SERV_DID_SHIFT)) & VFCCU_3_GINTOVFS_SERV_DID_MASK)
/*! @} */

/*! @name GDBGCFG - Global Debug */
/*! @{ */

#define VFCCU_3_GDBGCFG_FRZ_MASK                 (0x10000U)
#define VFCCU_3_GDBGCFG_FRZ_SHIFT                (16U)
#define VFCCU_3_GDBGCFG_FRZ_WIDTH                (1U)
#define VFCCU_3_GDBGCFG_FRZ(x)                   (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GDBGCFG_FRZ_SHIFT)) & VFCCU_3_GDBGCFG_FRZ_MASK)
/*! @} */

/*! @name GDBGSTAT - Global Debug Status */
/*! @{ */

#define VFCCU_3_GDBGSTAT_FLTIND_MASK             (0xFFU)
#define VFCCU_3_GDBGSTAT_FLTIND_SHIFT            (0U)
#define VFCCU_3_GDBGSTAT_FLTIND_WIDTH            (8U)
#define VFCCU_3_GDBGSTAT_FLTIND(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GDBGSTAT_FLTIND_SHIFT)) & VFCCU_3_GDBGSTAT_FLTIND_MASK)

#define VFCCU_3_GDBGSTAT_RKN_ACK_MASK            (0x40000000U)
#define VFCCU_3_GDBGSTAT_RKN_ACK_SHIFT           (30U)
#define VFCCU_3_GDBGSTAT_RKN_ACK_WIDTH           (1U)
#define VFCCU_3_GDBGSTAT_RKN_ACK(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GDBGSTAT_RKN_ACK_SHIFT)) & VFCCU_3_GDBGSTAT_RKN_ACK_MASK)

#define VFCCU_3_GDBGSTAT_RKN_REQ_MASK            (0x80000000U)
#define VFCCU_3_GDBGSTAT_RKN_REQ_SHIFT           (31U)
#define VFCCU_3_GDBGSTAT_RKN_REQ_WIDTH           (1U)
#define VFCCU_3_GDBGSTAT_RKN_REQ(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_GDBGSTAT_RKN_REQ_SHIFT)) & VFCCU_3_GDBGSTAT_RKN_REQ_MASK)
/*! @} */

/*! @name FHCFG0 - Fault Handler */
/*! @{ */

#define VFCCU_3_FHCFG0_FHIDEN_MASK               (0x1U)
#define VFCCU_3_FHCFG0_FHIDEN_SHIFT              (0U)
#define VFCCU_3_FHCFG0_FHIDEN_WIDTH              (1U)
#define VFCCU_3_FHCFG0_FHIDEN(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHCFG0_FHIDEN_SHIFT)) & VFCCU_3_FHCFG0_FHIDEN_MASK)
/*! @} */

/*! @name FHSRVDS0 - Fault Handler Status */
/*! @{ */

#define VFCCU_3_FHSRVDS0_SERV_DID_MASK           (0xFU)
#define VFCCU_3_FHSRVDS0_SERV_DID_SHIFT          (0U)
#define VFCCU_3_FHSRVDS0_SERV_DID_WIDTH          (4U)
#define VFCCU_3_FHSRVDS0_SERV_DID(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHSRVDS0_SERV_DID_SHIFT)) & VFCCU_3_FHSRVDS0_SERV_DID_MASK)

#define VFCCU_3_FHSRVDS0_AGGFLTS_MASK            (0x100U)
#define VFCCU_3_FHSRVDS0_AGGFLTS_SHIFT           (8U)
#define VFCCU_3_FHSRVDS0_AGGFLTS_WIDTH           (1U)
#define VFCCU_3_FHSRVDS0_AGGFLTS(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHSRVDS0_AGGFLTS_SHIFT)) & VFCCU_3_FHSRVDS0_AGGFLTS_MASK)
/*! @} */

/*! @name FHFLTENC0_0 - Fault Enable */
/*! @{ */

#define VFCCU_3_FHFLTENC0_0_EN0_MASK             (0x1U)
#define VFCCU_3_FHFLTENC0_0_EN0_SHIFT            (0U)
#define VFCCU_3_FHFLTENC0_0_EN0_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN0(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN0_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN0_MASK)

#define VFCCU_3_FHFLTENC0_0_EN1_MASK             (0x2U)
#define VFCCU_3_FHFLTENC0_0_EN1_SHIFT            (1U)
#define VFCCU_3_FHFLTENC0_0_EN1_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN1(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN1_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN1_MASK)

#define VFCCU_3_FHFLTENC0_0_EN2_MASK             (0x4U)
#define VFCCU_3_FHFLTENC0_0_EN2_SHIFT            (2U)
#define VFCCU_3_FHFLTENC0_0_EN2_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN2(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN2_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN2_MASK)

#define VFCCU_3_FHFLTENC0_0_EN3_MASK             (0x8U)
#define VFCCU_3_FHFLTENC0_0_EN3_SHIFT            (3U)
#define VFCCU_3_FHFLTENC0_0_EN3_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN3(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN3_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN3_MASK)

#define VFCCU_3_FHFLTENC0_0_EN4_MASK             (0x10U)
#define VFCCU_3_FHFLTENC0_0_EN4_SHIFT            (4U)
#define VFCCU_3_FHFLTENC0_0_EN4_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN4(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN4_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN4_MASK)

#define VFCCU_3_FHFLTENC0_0_EN5_MASK             (0x20U)
#define VFCCU_3_FHFLTENC0_0_EN5_SHIFT            (5U)
#define VFCCU_3_FHFLTENC0_0_EN5_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN5(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN5_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN5_MASK)

#define VFCCU_3_FHFLTENC0_0_EN6_MASK             (0x40U)
#define VFCCU_3_FHFLTENC0_0_EN6_SHIFT            (6U)
#define VFCCU_3_FHFLTENC0_0_EN6_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN6(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN6_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN6_MASK)

