zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHFLTENC0_0_EN7_MASK             (0x80U)
#define VFCCU_3_FHFLTENC0_0_EN7_SHIFT            (7U)
#define VFCCU_3_FHFLTENC0_0_EN7_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN7(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN7_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN7_MASK)

#define VFCCU_3_FHFLTENC0_0_EN8_MASK             (0x100U)
#define VFCCU_3_FHFLTENC0_0_EN8_SHIFT            (8U)
#define VFCCU_3_FHFLTENC0_0_EN8_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN8(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN8_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN8_MASK)

#define VFCCU_3_FHFLTENC0_0_EN9_MASK             (0x200U)
#define VFCCU_3_FHFLTENC0_0_EN9_SHIFT            (9U)
#define VFCCU_3_FHFLTENC0_0_EN9_WIDTH            (1U)
#define VFCCU_3_FHFLTENC0_0_EN9(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN9_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN9_MASK)

#define VFCCU_3_FHFLTENC0_0_EN10_MASK            (0x400U)
#define VFCCU_3_FHFLTENC0_0_EN10_SHIFT           (10U)
#define VFCCU_3_FHFLTENC0_0_EN10_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN10(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN10_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN10_MASK)

#define VFCCU_3_FHFLTENC0_0_EN11_MASK            (0x800U)
#define VFCCU_3_FHFLTENC0_0_EN11_SHIFT           (11U)
#define VFCCU_3_FHFLTENC0_0_EN11_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN11(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN11_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN11_MASK)

#define VFCCU_3_FHFLTENC0_0_EN12_MASK            (0x1000U)
#define VFCCU_3_FHFLTENC0_0_EN12_SHIFT           (12U)
#define VFCCU_3_FHFLTENC0_0_EN12_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN12(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN12_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN12_MASK)

#define VFCCU_3_FHFLTENC0_0_EN13_MASK            (0x2000U)
#define VFCCU_3_FHFLTENC0_0_EN13_SHIFT           (13U)
#define VFCCU_3_FHFLTENC0_0_EN13_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN13(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN13_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN13_MASK)

#define VFCCU_3_FHFLTENC0_0_EN14_MASK            (0x4000U)
#define VFCCU_3_FHFLTENC0_0_EN14_SHIFT           (14U)
#define VFCCU_3_FHFLTENC0_0_EN14_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN14(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN14_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN14_MASK)

#define VFCCU_3_FHFLTENC0_0_EN15_MASK            (0x8000U)
#define VFCCU_3_FHFLTENC0_0_EN15_SHIFT           (15U)
#define VFCCU_3_FHFLTENC0_0_EN15_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN15(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN15_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN15_MASK)

#define VFCCU_3_FHFLTENC0_0_EN16_MASK            (0x10000U)
#define VFCCU_3_FHFLTENC0_0_EN16_SHIFT           (16U)
#define VFCCU_3_FHFLTENC0_0_EN16_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN16(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN16_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN16_MASK)

#define VFCCU_3_FHFLTENC0_0_EN17_MASK            (0x20000U)
#define VFCCU_3_FHFLTENC0_0_EN17_SHIFT           (17U)
#define VFCCU_3_FHFLTENC0_0_EN17_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN17(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN17_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN17_MASK)

#define VFCCU_3_FHFLTENC0_0_EN18_MASK            (0x40000U)
#define VFCCU_3_FHFLTENC0_0_EN18_SHIFT           (18U)
#define VFCCU_3_FHFLTENC0_0_EN18_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN18(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN18_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN18_MASK)

#define VFCCU_3_FHFLTENC0_0_EN19_MASK            (0x80000U)
#define VFCCU_3_FHFLTENC0_0_EN19_SHIFT           (19U)
#define VFCCU_3_FHFLTENC0_0_EN19_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN19(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN19_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN19_MASK)

#define VFCCU_3_FHFLTENC0_0_EN20_MASK            (0x100000U)
#define VFCCU_3_FHFLTENC0_0_EN20_SHIFT           (20U)
#define VFCCU_3_FHFLTENC0_0_EN20_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN20(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN20_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN20_MASK)

#define VFCCU_3_FHFLTENC0_0_EN21_MASK            (0x200000U)
#define VFCCU_3_FHFLTENC0_0_EN21_SHIFT           (21U)
#define VFCCU_3_FHFLTENC0_0_EN21_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN21(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN21_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN21_MASK)

#define VFCCU_3_FHFLTENC0_0_EN22_MASK            (0x400000U)
#define VFCCU_3_FHFLTENC0_0_EN22_SHIFT           (22U)
#define VFCCU_3_FHFLTENC0_0_EN22_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN22(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN22_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN22_MASK)

#define VFCCU_3_FHFLTENC0_0_EN23_MASK            (0x800000U)
#define VFCCU_3_FHFLTENC0_0_EN23_SHIFT           (23U)
#define VFCCU_3_FHFLTENC0_0_EN23_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN23(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN23_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN23_MASK)

#define VFCCU_3_FHFLTENC0_0_EN24_MASK            (0x1000000U)
#define VFCCU_3_FHFLTENC0_0_EN24_SHIFT           (24U)
#define VFCCU_3_FHFLTENC0_0_EN24_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN24(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN24_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN24_MASK)

#define VFCCU_3_FHFLTENC0_0_EN25_MASK            (0x2000000U)
#define VFCCU_3_FHFLTENC0_0_EN25_SHIFT           (25U)
#define VFCCU_3_FHFLTENC0_0_EN25_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN25(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN25_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN25_MASK)

#define VFCCU_3_FHFLTENC0_0_EN26_MASK            (0x4000000U)
#define VFCCU_3_FHFLTENC0_0_EN26_SHIFT           (26U)
#define VFCCU_3_FHFLTENC0_0_EN26_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN26(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN26_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN26_MASK)

#define VFCCU_3_FHFLTENC0_0_EN27_MASK            (0x8000000U)
#define VFCCU_3_FHFLTENC0_0_EN27_SHIFT           (27U)
#define VFCCU_3_FHFLTENC0_0_EN27_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN27(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN27_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN27_MASK)

#define VFCCU_3_FHFLTENC0_0_EN28_MASK            (0x10000000U)
#define VFCCU_3_FHFLTENC0_0_EN28_SHIFT           (28U)
#define VFCCU_3_FHFLTENC0_0_EN28_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN28(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN28_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN28_MASK)

