zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHFLTENC0_0_EN29_MASK            (0x20000000U)
#define VFCCU_3_FHFLTENC0_0_EN29_SHIFT           (29U)
#define VFCCU_3_FHFLTENC0_0_EN29_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN29(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN29_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN29_MASK)

#define VFCCU_3_FHFLTENC0_0_EN30_MASK            (0x40000000U)
#define VFCCU_3_FHFLTENC0_0_EN30_SHIFT           (30U)
#define VFCCU_3_FHFLTENC0_0_EN30_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN30(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN30_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN30_MASK)

#define VFCCU_3_FHFLTENC0_0_EN31_MASK            (0x80000000U)
#define VFCCU_3_FHFLTENC0_0_EN31_SHIFT           (31U)
#define VFCCU_3_FHFLTENC0_0_EN31_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_0_EN31(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_0_EN31_SHIFT)) & VFCCU_3_FHFLTENC0_0_EN31_MASK)
/*! @} */

/*! @name FHFLTENC0_1 - Fault Enable */
/*! @{ */

#define VFCCU_3_FHFLTENC0_1_EN32_MASK            (0x1U)
#define VFCCU_3_FHFLTENC0_1_EN32_SHIFT           (0U)
#define VFCCU_3_FHFLTENC0_1_EN32_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN32(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN32_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN32_MASK)

#define VFCCU_3_FHFLTENC0_1_EN33_MASK            (0x2U)
#define VFCCU_3_FHFLTENC0_1_EN33_SHIFT           (1U)
#define VFCCU_3_FHFLTENC0_1_EN33_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN33(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN33_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN33_MASK)

#define VFCCU_3_FHFLTENC0_1_EN34_MASK            (0x4U)
#define VFCCU_3_FHFLTENC0_1_EN34_SHIFT           (2U)
#define VFCCU_3_FHFLTENC0_1_EN34_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN34(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN34_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN34_MASK)

#define VFCCU_3_FHFLTENC0_1_EN35_MASK            (0x8U)
#define VFCCU_3_FHFLTENC0_1_EN35_SHIFT           (3U)
#define VFCCU_3_FHFLTENC0_1_EN35_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN35(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN35_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN35_MASK)

#define VFCCU_3_FHFLTENC0_1_EN36_MASK            (0x10U)
#define VFCCU_3_FHFLTENC0_1_EN36_SHIFT           (4U)
#define VFCCU_3_FHFLTENC0_1_EN36_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN36(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN36_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN36_MASK)

#define VFCCU_3_FHFLTENC0_1_EN37_MASK            (0x20U)
#define VFCCU_3_FHFLTENC0_1_EN37_SHIFT           (5U)
#define VFCCU_3_FHFLTENC0_1_EN37_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN37(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN37_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN37_MASK)

#define VFCCU_3_FHFLTENC0_1_EN38_MASK            (0x40U)
#define VFCCU_3_FHFLTENC0_1_EN38_SHIFT           (6U)
#define VFCCU_3_FHFLTENC0_1_EN38_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN38(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN38_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN38_MASK)

#define VFCCU_3_FHFLTENC0_1_EN39_MASK            (0x80U)
#define VFCCU_3_FHFLTENC0_1_EN39_SHIFT           (7U)
#define VFCCU_3_FHFLTENC0_1_EN39_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN39(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN39_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN39_MASK)

#define VFCCU_3_FHFLTENC0_1_EN40_MASK            (0x100U)
#define VFCCU_3_FHFLTENC0_1_EN40_SHIFT           (8U)
#define VFCCU_3_FHFLTENC0_1_EN40_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN40(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN40_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN40_MASK)

#define VFCCU_3_FHFLTENC0_1_EN41_MASK            (0x200U)
#define VFCCU_3_FHFLTENC0_1_EN41_SHIFT           (9U)
#define VFCCU_3_FHFLTENC0_1_EN41_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN41(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN41_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN41_MASK)

#define VFCCU_3_FHFLTENC0_1_EN42_MASK            (0x400U)
#define VFCCU_3_FHFLTENC0_1_EN42_SHIFT           (10U)
#define VFCCU_3_FHFLTENC0_1_EN42_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN42(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN42_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN42_MASK)

#define VFCCU_3_FHFLTENC0_1_EN43_MASK            (0x800U)
#define VFCCU_3_FHFLTENC0_1_EN43_SHIFT           (11U)
#define VFCCU_3_FHFLTENC0_1_EN43_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN43(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN43_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN43_MASK)

#define VFCCU_3_FHFLTENC0_1_EN44_MASK            (0x1000U)
#define VFCCU_3_FHFLTENC0_1_EN44_SHIFT           (12U)
#define VFCCU_3_FHFLTENC0_1_EN44_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN44(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN44_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN44_MASK)

#define VFCCU_3_FHFLTENC0_1_EN45_MASK            (0x2000U)
#define VFCCU_3_FHFLTENC0_1_EN45_SHIFT           (13U)
#define VFCCU_3_FHFLTENC0_1_EN45_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN45(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN45_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN45_MASK)

#define VFCCU_3_FHFLTENC0_1_EN46_MASK            (0x4000U)
#define VFCCU_3_FHFLTENC0_1_EN46_SHIFT           (14U)
#define VFCCU_3_FHFLTENC0_1_EN46_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN46(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN46_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN46_MASK)

#define VFCCU_3_FHFLTENC0_1_EN47_MASK            (0x8000U)
#define VFCCU_3_FHFLTENC0_1_EN47_SHIFT           (15U)
#define VFCCU_3_FHFLTENC0_1_EN47_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN47(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN47_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN47_MASK)

