zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHFLTENC0_1_EN48_MASK            (0x10000U)
#define VFCCU_3_FHFLTENC0_1_EN48_SHIFT           (16U)
#define VFCCU_3_FHFLTENC0_1_EN48_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN48(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN48_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN48_MASK)

#define VFCCU_3_FHFLTENC0_1_EN49_MASK            (0x20000U)
#define VFCCU_3_FHFLTENC0_1_EN49_SHIFT           (17U)
#define VFCCU_3_FHFLTENC0_1_EN49_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN49(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN49_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN49_MASK)

#define VFCCU_3_FHFLTENC0_1_EN50_MASK            (0x40000U)
#define VFCCU_3_FHFLTENC0_1_EN50_SHIFT           (18U)
#define VFCCU_3_FHFLTENC0_1_EN50_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN50(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN50_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN50_MASK)

#define VFCCU_3_FHFLTENC0_1_EN51_MASK            (0x80000U)
#define VFCCU_3_FHFLTENC0_1_EN51_SHIFT           (19U)
#define VFCCU_3_FHFLTENC0_1_EN51_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN51(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN51_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN51_MASK)

#define VFCCU_3_FHFLTENC0_1_EN52_MASK            (0x100000U)
#define VFCCU_3_FHFLTENC0_1_EN52_SHIFT           (20U)
#define VFCCU_3_FHFLTENC0_1_EN52_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN52(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN52_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN52_MASK)

#define VFCCU_3_FHFLTENC0_1_EN53_MASK            (0x200000U)
#define VFCCU_3_FHFLTENC0_1_EN53_SHIFT           (21U)
#define VFCCU_3_FHFLTENC0_1_EN53_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN53(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN53_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN53_MASK)

#define VFCCU_3_FHFLTENC0_1_EN54_MASK            (0x400000U)
#define VFCCU_3_FHFLTENC0_1_EN54_SHIFT           (22U)
#define VFCCU_3_FHFLTENC0_1_EN54_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN54(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN54_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN54_MASK)

#define VFCCU_3_FHFLTENC0_1_EN55_MASK            (0x800000U)
#define VFCCU_3_FHFLTENC0_1_EN55_SHIFT           (23U)
#define VFCCU_3_FHFLTENC0_1_EN55_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN55(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN55_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN55_MASK)

#define VFCCU_3_FHFLTENC0_1_EN56_MASK            (0x1000000U)
#define VFCCU_3_FHFLTENC0_1_EN56_SHIFT           (24U)
#define VFCCU_3_FHFLTENC0_1_EN56_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN56(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN56_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN56_MASK)

#define VFCCU_3_FHFLTENC0_1_EN57_MASK            (0x2000000U)
#define VFCCU_3_FHFLTENC0_1_EN57_SHIFT           (25U)
#define VFCCU_3_FHFLTENC0_1_EN57_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN57(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN57_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN57_MASK)

#define VFCCU_3_FHFLTENC0_1_EN58_MASK            (0x4000000U)
#define VFCCU_3_FHFLTENC0_1_EN58_SHIFT           (26U)
#define VFCCU_3_FHFLTENC0_1_EN58_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN58(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN58_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN58_MASK)

#define VFCCU_3_FHFLTENC0_1_EN59_MASK            (0x8000000U)
#define VFCCU_3_FHFLTENC0_1_EN59_SHIFT           (27U)
#define VFCCU_3_FHFLTENC0_1_EN59_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN59(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN59_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN59_MASK)

#define VFCCU_3_FHFLTENC0_1_EN60_MASK            (0x10000000U)
#define VFCCU_3_FHFLTENC0_1_EN60_SHIFT           (28U)
#define VFCCU_3_FHFLTENC0_1_EN60_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN60(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN60_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN60_MASK)

#define VFCCU_3_FHFLTENC0_1_EN61_MASK            (0x20000000U)
#define VFCCU_3_FHFLTENC0_1_EN61_SHIFT           (29U)
#define VFCCU_3_FHFLTENC0_1_EN61_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN61(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN61_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN61_MASK)

#define VFCCU_3_FHFLTENC0_1_EN62_MASK            (0x40000000U)
#define VFCCU_3_FHFLTENC0_1_EN62_SHIFT           (30U)
#define VFCCU_3_FHFLTENC0_1_EN62_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN62(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN62_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN62_MASK)

#define VFCCU_3_FHFLTENC0_1_EN63_MASK            (0x80000000U)
#define VFCCU_3_FHFLTENC0_1_EN63_SHIFT           (31U)
#define VFCCU_3_FHFLTENC0_1_EN63_WIDTH           (1U)
#define VFCCU_3_FHFLTENC0_1_EN63(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTENC0_1_EN63_SHIFT)) & VFCCU_3_FHFLTENC0_1_EN63_MASK)
/*! @} */

/*! @name FHFLTS0_0 - Fault Status */
/*! @{ */

#define VFCCU_3_FHFLTS0_0_STAT0_MASK             (0x1U)
#define VFCCU_3_FHFLTS0_0_STAT0_SHIFT            (0U)
#define VFCCU_3_FHFLTS0_0_STAT0_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT0(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT0_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT0_MASK)

#define VFCCU_3_FHFLTS0_0_STAT1_MASK             (0x2U)
#define VFCCU_3_FHFLTS0_0_STAT1_SHIFT            (1U)
#define VFCCU_3_FHFLTS0_0_STAT1_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT1(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT1_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT1_MASK)

#define VFCCU_3_FHFLTS0_0_STAT2_MASK             (0x4U)
#define VFCCU_3_FHFLTS0_0_STAT2_SHIFT            (2U)
#define VFCCU_3_FHFLTS0_0_STAT2_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT2(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT2_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT2_MASK)

#define VFCCU_3_FHFLTS0_0_STAT3_MASK             (0x8U)
#define VFCCU_3_FHFLTS0_0_STAT3_SHIFT            (3U)
#define VFCCU_3_FHFLTS0_0_STAT3_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT3(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT3_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT3_MASK)

#define VFCCU_3_FHFLTS0_0_STAT4_MASK             (0x10U)
#define VFCCU_3_FHFLTS0_0_STAT4_SHIFT            (4U)
#define VFCCU_3_FHFLTS0_0_STAT4_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT4(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT4_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT4_MASK)

#define VFCCU_3_FHFLTS0_0_STAT5_MASK             (0x20U)
#define VFCCU_3_FHFLTS0_0_STAT5_SHIFT            (5U)
#define VFCCU_3_FHFLTS0_0_STAT5_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT5(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT5_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT5_MASK)

#define VFCCU_3_FHFLTS0_0_STAT6_MASK             (0x40U)
#define VFCCU_3_FHFLTS0_0_STAT6_SHIFT            (6U)
#define VFCCU_3_FHFLTS0_0_STAT6_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT6(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT6_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT6_MASK)

#define VFCCU_3_FHFLTS0_0_STAT7_MASK             (0x80U)
#define VFCCU_3_FHFLTS0_0_STAT7_SHIFT            (7U)
#define VFCCU_3_FHFLTS0_0_STAT7_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT7(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT7_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT7_MASK)

#define VFCCU_3_FHFLTS0_0_STAT8_MASK             (0x100U)
#define VFCCU_3_FHFLTS0_0_STAT8_SHIFT            (8U)
#define VFCCU_3_FHFLTS0_0_STAT8_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT8(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT8_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT8_MASK)

