zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHFLTS0_0_STAT9_MASK             (0x200U)
#define VFCCU_3_FHFLTS0_0_STAT9_SHIFT            (9U)
#define VFCCU_3_FHFLTS0_0_STAT9_WIDTH            (1U)
#define VFCCU_3_FHFLTS0_0_STAT9(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT9_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT9_MASK)

#define VFCCU_3_FHFLTS0_0_STAT10_MASK            (0x400U)
#define VFCCU_3_FHFLTS0_0_STAT10_SHIFT           (10U)
#define VFCCU_3_FHFLTS0_0_STAT10_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT10(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT10_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT10_MASK)

#define VFCCU_3_FHFLTS0_0_STAT11_MASK            (0x800U)
#define VFCCU_3_FHFLTS0_0_STAT11_SHIFT           (11U)
#define VFCCU_3_FHFLTS0_0_STAT11_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT11(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT11_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT11_MASK)

#define VFCCU_3_FHFLTS0_0_STAT12_MASK            (0x1000U)
#define VFCCU_3_FHFLTS0_0_STAT12_SHIFT           (12U)
#define VFCCU_3_FHFLTS0_0_STAT12_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT12(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT12_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT12_MASK)

#define VFCCU_3_FHFLTS0_0_STAT13_MASK            (0x2000U)
#define VFCCU_3_FHFLTS0_0_STAT13_SHIFT           (13U)
#define VFCCU_3_FHFLTS0_0_STAT13_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT13(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT13_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT13_MASK)

#define VFCCU_3_FHFLTS0_0_STAT14_MASK            (0x4000U)
#define VFCCU_3_FHFLTS0_0_STAT14_SHIFT           (14U)
#define VFCCU_3_FHFLTS0_0_STAT14_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT14(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT14_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT14_MASK)

#define VFCCU_3_FHFLTS0_0_STAT15_MASK            (0x8000U)
#define VFCCU_3_FHFLTS0_0_STAT15_SHIFT           (15U)
#define VFCCU_3_FHFLTS0_0_STAT15_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT15(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT15_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT15_MASK)

#define VFCCU_3_FHFLTS0_0_STAT16_MASK            (0x10000U)
#define VFCCU_3_FHFLTS0_0_STAT16_SHIFT           (16U)
#define VFCCU_3_FHFLTS0_0_STAT16_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT16(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT16_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT16_MASK)

#define VFCCU_3_FHFLTS0_0_STAT17_MASK            (0x20000U)
#define VFCCU_3_FHFLTS0_0_STAT17_SHIFT           (17U)
#define VFCCU_3_FHFLTS0_0_STAT17_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT17(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT17_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT17_MASK)

#define VFCCU_3_FHFLTS0_0_STAT18_MASK            (0x40000U)
#define VFCCU_3_FHFLTS0_0_STAT18_SHIFT           (18U)
#define VFCCU_3_FHFLTS0_0_STAT18_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT18(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT18_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT18_MASK)

#define VFCCU_3_FHFLTS0_0_STAT19_MASK            (0x80000U)
#define VFCCU_3_FHFLTS0_0_STAT19_SHIFT           (19U)
#define VFCCU_3_FHFLTS0_0_STAT19_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT19(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT19_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT19_MASK)

#define VFCCU_3_FHFLTS0_0_STAT20_MASK            (0x100000U)
#define VFCCU_3_FHFLTS0_0_STAT20_SHIFT           (20U)
#define VFCCU_3_FHFLTS0_0_STAT20_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT20(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT20_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT20_MASK)

#define VFCCU_3_FHFLTS0_0_STAT21_MASK            (0x200000U)
#define VFCCU_3_FHFLTS0_0_STAT21_SHIFT           (21U)
#define VFCCU_3_FHFLTS0_0_STAT21_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT21(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT21_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT21_MASK)

#define VFCCU_3_FHFLTS0_0_STAT22_MASK            (0x400000U)
#define VFCCU_3_FHFLTS0_0_STAT22_SHIFT           (22U)
#define VFCCU_3_FHFLTS0_0_STAT22_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT22(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT22_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT22_MASK)

#define VFCCU_3_FHFLTS0_0_STAT23_MASK            (0x800000U)
#define VFCCU_3_FHFLTS0_0_STAT23_SHIFT           (23U)
#define VFCCU_3_FHFLTS0_0_STAT23_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT23(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT23_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT23_MASK)

#define VFCCU_3_FHFLTS0_0_STAT24_MASK            (0x1000000U)
#define VFCCU_3_FHFLTS0_0_STAT24_SHIFT           (24U)
#define VFCCU_3_FHFLTS0_0_STAT24_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT24(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT24_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT24_MASK)

#define VFCCU_3_FHFLTS0_0_STAT25_MASK            (0x2000000U)
#define VFCCU_3_FHFLTS0_0_STAT25_SHIFT           (25U)
#define VFCCU_3_FHFLTS0_0_STAT25_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT25(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT25_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT25_MASK)

#define VFCCU_3_FHFLTS0_0_STAT26_MASK            (0x4000000U)
#define VFCCU_3_FHFLTS0_0_STAT26_SHIFT           (26U)
#define VFCCU_3_FHFLTS0_0_STAT26_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT26(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT26_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT26_MASK)

#define VFCCU_3_FHFLTS0_0_STAT27_MASK            (0x8000000U)
#define VFCCU_3_FHFLTS0_0_STAT27_SHIFT           (27U)
#define VFCCU_3_FHFLTS0_0_STAT27_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT27(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT27_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT27_MASK)

#define VFCCU_3_FHFLTS0_0_STAT28_MASK            (0x10000000U)
#define VFCCU_3_FHFLTS0_0_STAT28_SHIFT           (28U)
#define VFCCU_3_FHFLTS0_0_STAT28_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT28(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT28_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT28_MASK)

#define VFCCU_3_FHFLTS0_0_STAT29_MASK            (0x20000000U)
#define VFCCU_3_FHFLTS0_0_STAT29_SHIFT           (29U)
#define VFCCU_3_FHFLTS0_0_STAT29_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT29(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT29_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT29_MASK)

#define VFCCU_3_FHFLTS0_0_STAT30_MASK            (0x40000000U)
#define VFCCU_3_FHFLTS0_0_STAT30_SHIFT           (30U)
#define VFCCU_3_FHFLTS0_0_STAT30_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT30(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT30_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT30_MASK)

