zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHFLTS0_0_STAT31_MASK            (0x80000000U)
#define VFCCU_3_FHFLTS0_0_STAT31_SHIFT           (31U)
#define VFCCU_3_FHFLTS0_0_STAT31_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_0_STAT31(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_0_STAT31_SHIFT)) & VFCCU_3_FHFLTS0_0_STAT31_MASK)
/*! @} */

/*! @name FHFLTS0_1 - Fault Status */
/*! @{ */

#define VFCCU_3_FHFLTS0_1_STAT32_MASK            (0x1U)
#define VFCCU_3_FHFLTS0_1_STAT32_SHIFT           (0U)
#define VFCCU_3_FHFLTS0_1_STAT32_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT32(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT32_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT32_MASK)

#define VFCCU_3_FHFLTS0_1_STAT33_MASK            (0x2U)
#define VFCCU_3_FHFLTS0_1_STAT33_SHIFT           (1U)
#define VFCCU_3_FHFLTS0_1_STAT33_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT33(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT33_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT33_MASK)

#define VFCCU_3_FHFLTS0_1_STAT34_MASK            (0x4U)
#define VFCCU_3_FHFLTS0_1_STAT34_SHIFT           (2U)
#define VFCCU_3_FHFLTS0_1_STAT34_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT34(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT34_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT34_MASK)

#define VFCCU_3_FHFLTS0_1_STAT35_MASK            (0x8U)
#define VFCCU_3_FHFLTS0_1_STAT35_SHIFT           (3U)
#define VFCCU_3_FHFLTS0_1_STAT35_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT35(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT35_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT35_MASK)

#define VFCCU_3_FHFLTS0_1_STAT36_MASK            (0x10U)
#define VFCCU_3_FHFLTS0_1_STAT36_SHIFT           (4U)
#define VFCCU_3_FHFLTS0_1_STAT36_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT36(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT36_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT36_MASK)

#define VFCCU_3_FHFLTS0_1_STAT37_MASK            (0x20U)
#define VFCCU_3_FHFLTS0_1_STAT37_SHIFT           (5U)
#define VFCCU_3_FHFLTS0_1_STAT37_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT37(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT37_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT37_MASK)

#define VFCCU_3_FHFLTS0_1_STAT38_MASK            (0x40U)
#define VFCCU_3_FHFLTS0_1_STAT38_SHIFT           (6U)
#define VFCCU_3_FHFLTS0_1_STAT38_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT38(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT38_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT38_MASK)

#define VFCCU_3_FHFLTS0_1_STAT39_MASK            (0x80U)
#define VFCCU_3_FHFLTS0_1_STAT39_SHIFT           (7U)
#define VFCCU_3_FHFLTS0_1_STAT39_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT39(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT39_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT39_MASK)

#define VFCCU_3_FHFLTS0_1_STAT40_MASK            (0x100U)
#define VFCCU_3_FHFLTS0_1_STAT40_SHIFT           (8U)
#define VFCCU_3_FHFLTS0_1_STAT40_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT40(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT40_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT40_MASK)

#define VFCCU_3_FHFLTS0_1_STAT41_MASK            (0x200U)
#define VFCCU_3_FHFLTS0_1_STAT41_SHIFT           (9U)
#define VFCCU_3_FHFLTS0_1_STAT41_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT41(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT41_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT41_MASK)

#define VFCCU_3_FHFLTS0_1_STAT42_MASK            (0x400U)
#define VFCCU_3_FHFLTS0_1_STAT42_SHIFT           (10U)
#define VFCCU_3_FHFLTS0_1_STAT42_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT42(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT42_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT42_MASK)

#define VFCCU_3_FHFLTS0_1_STAT43_MASK            (0x800U)
#define VFCCU_3_FHFLTS0_1_STAT43_SHIFT           (11U)
#define VFCCU_3_FHFLTS0_1_STAT43_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT43(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT43_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT43_MASK)

#define VFCCU_3_FHFLTS0_1_STAT44_MASK            (0x1000U)
#define VFCCU_3_FHFLTS0_1_STAT44_SHIFT           (12U)
#define VFCCU_3_FHFLTS0_1_STAT44_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT44(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT44_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT44_MASK)

#define VFCCU_3_FHFLTS0_1_STAT45_MASK            (0x2000U)
#define VFCCU_3_FHFLTS0_1_STAT45_SHIFT           (13U)
#define VFCCU_3_FHFLTS0_1_STAT45_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT45(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT45_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT45_MASK)

#define VFCCU_3_FHFLTS0_1_STAT46_MASK            (0x4000U)
#define VFCCU_3_FHFLTS0_1_STAT46_SHIFT           (14U)
#define VFCCU_3_FHFLTS0_1_STAT46_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT46(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT46_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT46_MASK)

#define VFCCU_3_FHFLTS0_1_STAT47_MASK            (0x8000U)
#define VFCCU_3_FHFLTS0_1_STAT47_SHIFT           (15U)
#define VFCCU_3_FHFLTS0_1_STAT47_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT47(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT47_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT47_MASK)

#define VFCCU_3_FHFLTS0_1_STAT48_MASK            (0x10000U)
#define VFCCU_3_FHFLTS0_1_STAT48_SHIFT           (16U)
#define VFCCU_3_FHFLTS0_1_STAT48_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT48(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT48_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT48_MASK)

#define VFCCU_3_FHFLTS0_1_STAT49_MASK            (0x20000U)
#define VFCCU_3_FHFLTS0_1_STAT49_SHIFT           (17U)
#define VFCCU_3_FHFLTS0_1_STAT49_WIDTH           (1U)
#define VFCCU_3_FHFLTS0_1_STAT49(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTS0_1_STAT49_SHIFT)) & VFCCU_3_FHFLTS0_1_STAT49_MASK)

