zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHFLTRKC0_8_RKNSEL34_MASK        (0x70000U)
#define VFCCU_3_FHFLTRKC0_8_RKNSEL34_SHIFT       (16U)
#define VFCCU_3_FHFLTRKC0_8_RKNSEL34_WIDTH       (3U)
#define VFCCU_3_FHFLTRKC0_8_RKNSEL34(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_8_RKNSEL34_SHIFT)) & VFCCU_3_FHFLTRKC0_8_RKNSEL34_MASK)

#define VFCCU_3_FHFLTRKC0_8_RKNSEL35_MASK        (0x7000000U)
#define VFCCU_3_FHFLTRKC0_8_RKNSEL35_SHIFT       (24U)
#define VFCCU_3_FHFLTRKC0_8_RKNSEL35_WIDTH       (3U)
#define VFCCU_3_FHFLTRKC0_8_RKNSEL35(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_8_RKNSEL35_SHIFT)) & VFCCU_3_FHFLTRKC0_8_RKNSEL35_MASK)
/*! @} */

/*! @name FHFLTRKC0_9 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_3_FHFLTRKC0_9_RKNSEL36_MASK        (0x7U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL36_SHIFT       (0U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL36_WIDTH       (3U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL36(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_9_RKNSEL36_SHIFT)) & VFCCU_3_FHFLTRKC0_9_RKNSEL36_MASK)

#define VFCCU_3_FHFLTRKC0_9_RKNSEL37_MASK        (0x700U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL37_SHIFT       (8U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL37_WIDTH       (3U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL37(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_9_RKNSEL37_SHIFT)) & VFCCU_3_FHFLTRKC0_9_RKNSEL37_MASK)

#define VFCCU_3_FHFLTRKC0_9_RKNSEL38_MASK        (0x70000U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL38_SHIFT       (16U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL38_WIDTH       (3U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL38(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_9_RKNSEL38_SHIFT)) & VFCCU_3_FHFLTRKC0_9_RKNSEL38_MASK)

#define VFCCU_3_FHFLTRKC0_9_RKNSEL39_MASK        (0x7000000U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL39_SHIFT       (24U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL39_WIDTH       (3U)
#define VFCCU_3_FHFLTRKC0_9_RKNSEL39(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_9_RKNSEL39_SHIFT)) & VFCCU_3_FHFLTRKC0_9_RKNSEL39_MASK)
/*! @} */

/*! @name FHFLTRKC0_10 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_3_FHFLTRKC0_10_RKNSEL40_MASK       (0x7U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL40_SHIFT      (0U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL40_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL40(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_10_RKNSEL40_SHIFT)) & VFCCU_3_FHFLTRKC0_10_RKNSEL40_MASK)

#define VFCCU_3_FHFLTRKC0_10_RKNSEL41_MASK       (0x700U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL41_SHIFT      (8U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL41_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL41(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_10_RKNSEL41_SHIFT)) & VFCCU_3_FHFLTRKC0_10_RKNSEL41_MASK)

#define VFCCU_3_FHFLTRKC0_10_RKNSEL42_MASK       (0x70000U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL42_SHIFT      (16U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL42_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL42(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_10_RKNSEL42_SHIFT)) & VFCCU_3_FHFLTRKC0_10_RKNSEL42_MASK)

#define VFCCU_3_FHFLTRKC0_10_RKNSEL43_MASK       (0x7000000U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL43_SHIFT      (24U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL43_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_10_RKNSEL43(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_10_RKNSEL43_SHIFT)) & VFCCU_3_FHFLTRKC0_10_RKNSEL43_MASK)
/*! @} */

/*! @name FHFLTRKC0_11 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_3_FHFLTRKC0_11_RKNSEL44_MASK       (0x7U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL44_SHIFT      (0U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL44_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL44(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_11_RKNSEL44_SHIFT)) & VFCCU_3_FHFLTRKC0_11_RKNSEL44_MASK)

#define VFCCU_3_FHFLTRKC0_11_RKNSEL45_MASK       (0x700U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL45_SHIFT      (8U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL45_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL45(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_11_RKNSEL45_SHIFT)) & VFCCU_3_FHFLTRKC0_11_RKNSEL45_MASK)

#define VFCCU_3_FHFLTRKC0_11_RKNSEL46_MASK       (0x70000U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL46_SHIFT      (16U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL46_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL46(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_11_RKNSEL46_SHIFT)) & VFCCU_3_FHFLTRKC0_11_RKNSEL46_MASK)

#define VFCCU_3_FHFLTRKC0_11_RKNSEL47_MASK       (0x7000000U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL47_SHIFT      (24U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL47_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_11_RKNSEL47(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_11_RKNSEL47_SHIFT)) & VFCCU_3_FHFLTRKC0_11_RKNSEL47_MASK)
/*! @} */

/*! @name FHFLTRKC0_12 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_3_FHFLTRKC0_12_RKNSEL48_MASK       (0x7U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL48_SHIFT      (0U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL48_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL48(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_12_RKNSEL48_SHIFT)) & VFCCU_3_FHFLTRKC0_12_RKNSEL48_MASK)

#define VFCCU_3_FHFLTRKC0_12_RKNSEL49_MASK       (0x700U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL49_SHIFT      (8U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL49_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL49(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_12_RKNSEL49_SHIFT)) & VFCCU_3_FHFLTRKC0_12_RKNSEL49_MASK)

#define VFCCU_3_FHFLTRKC0_12_RKNSEL50_MASK       (0x70000U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL50_SHIFT      (16U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL50_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL50(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_12_RKNSEL50_SHIFT)) & VFCCU_3_FHFLTRKC0_12_RKNSEL50_MASK)

#define VFCCU_3_FHFLTRKC0_12_RKNSEL51_MASK       (0x7000000U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL51_SHIFT      (24U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL51_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_12_RKNSEL51(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_12_RKNSEL51_SHIFT)) & VFCCU_3_FHFLTRKC0_12_RKNSEL51_MASK)
/*! @} */

/*! @name FHFLTRKC0_13 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_3_FHFLTRKC0_13_RKNSEL52_MASK       (0x7U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL52_SHIFT      (0U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL52_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL52(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_13_RKNSEL52_SHIFT)) & VFCCU_3_FHFLTRKC0_13_RKNSEL52_MASK)

