zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHFLTRKC0_13_RKNSEL53_MASK       (0x700U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL53_SHIFT      (8U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL53_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL53(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_13_RKNSEL53_SHIFT)) & VFCCU_3_FHFLTRKC0_13_RKNSEL53_MASK)

#define VFCCU_3_FHFLTRKC0_13_RKNSEL54_MASK       (0x70000U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL54_SHIFT      (16U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL54_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL54(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_13_RKNSEL54_SHIFT)) & VFCCU_3_FHFLTRKC0_13_RKNSEL54_MASK)

#define VFCCU_3_FHFLTRKC0_13_RKNSEL55_MASK       (0x7000000U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL55_SHIFT      (24U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL55_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_13_RKNSEL55(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_13_RKNSEL55_SHIFT)) & VFCCU_3_FHFLTRKC0_13_RKNSEL55_MASK)
/*! @} */

/*! @name FHFLTRKC0_14 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_3_FHFLTRKC0_14_RKNSEL56_MASK       (0x7U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL56_SHIFT      (0U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL56_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL56(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_14_RKNSEL56_SHIFT)) & VFCCU_3_FHFLTRKC0_14_RKNSEL56_MASK)

#define VFCCU_3_FHFLTRKC0_14_RKNSEL57_MASK       (0x700U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL57_SHIFT      (8U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL57_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL57(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_14_RKNSEL57_SHIFT)) & VFCCU_3_FHFLTRKC0_14_RKNSEL57_MASK)

#define VFCCU_3_FHFLTRKC0_14_RKNSEL58_MASK       (0x70000U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL58_SHIFT      (16U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL58_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL58(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_14_RKNSEL58_SHIFT)) & VFCCU_3_FHFLTRKC0_14_RKNSEL58_MASK)

#define VFCCU_3_FHFLTRKC0_14_RKNSEL59_MASK       (0x7000000U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL59_SHIFT      (24U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL59_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_14_RKNSEL59(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_14_RKNSEL59_SHIFT)) & VFCCU_3_FHFLTRKC0_14_RKNSEL59_MASK)
/*! @} */

/*! @name FHFLTRKC0_15 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_3_FHFLTRKC0_15_RKNSEL60_MASK       (0x7U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL60_SHIFT      (0U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL60_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL60(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_15_RKNSEL60_SHIFT)) & VFCCU_3_FHFLTRKC0_15_RKNSEL60_MASK)

#define VFCCU_3_FHFLTRKC0_15_RKNSEL61_MASK       (0x700U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL61_SHIFT      (8U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL61_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL61(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_15_RKNSEL61_SHIFT)) & VFCCU_3_FHFLTRKC0_15_RKNSEL61_MASK)

#define VFCCU_3_FHFLTRKC0_15_RKNSEL62_MASK       (0x70000U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL62_SHIFT      (16U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL62_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL62(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_15_RKNSEL62_SHIFT)) & VFCCU_3_FHFLTRKC0_15_RKNSEL62_MASK)

#define VFCCU_3_FHFLTRKC0_15_RKNSEL63_MASK       (0x7000000U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL63_SHIFT      (24U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL63_WIDTH      (3U)
#define VFCCU_3_FHFLTRKC0_15_RKNSEL63(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHFLTRKC0_15_RKNSEL63_SHIFT)) & VFCCU_3_FHFLTRKC0_15_RKNSEL63_MASK)
/*! @} */

/*! @name FHIMRKC0_00 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_3_FHIMRKC0_00_RKNEN0_MASK          (0x1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN0_SHIFT         (0U)
#define VFCCU_3_FHIMRKC0_00_RKNEN0_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN0_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN0_MASK)

#define VFCCU_3_FHIMRKC0_00_RKNEN1_MASK          (0x2U)
#define VFCCU_3_FHIMRKC0_00_RKNEN1_SHIFT         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN1_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN1_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN1_MASK)

#define VFCCU_3_FHIMRKC0_00_RKNEN2_MASK          (0x4U)
#define VFCCU_3_FHIMRKC0_00_RKNEN2_SHIFT         (2U)
#define VFCCU_3_FHIMRKC0_00_RKNEN2_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN2_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN2_MASK)

#define VFCCU_3_FHIMRKC0_00_RKNEN3_MASK          (0x8U)
#define VFCCU_3_FHIMRKC0_00_RKNEN3_SHIFT         (3U)
#define VFCCU_3_FHIMRKC0_00_RKNEN3_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN3_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN3_MASK)

#define VFCCU_3_FHIMRKC0_00_RKNEN4_MASK          (0x10U)
#define VFCCU_3_FHIMRKC0_00_RKNEN4_SHIFT         (4U)
#define VFCCU_3_FHIMRKC0_00_RKNEN4_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN4_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN4_MASK)

#define VFCCU_3_FHIMRKC0_00_RKNEN5_MASK          (0x20U)
#define VFCCU_3_FHIMRKC0_00_RKNEN5_SHIFT         (5U)
#define VFCCU_3_FHIMRKC0_00_RKNEN5_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN5_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN5_MASK)

#define VFCCU_3_FHIMRKC0_00_RKNEN6_MASK          (0x40U)
#define VFCCU_3_FHIMRKC0_00_RKNEN6_SHIFT         (6U)
#define VFCCU_3_FHIMRKC0_00_RKNEN6_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN6_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN6_MASK)

#define VFCCU_3_FHIMRKC0_00_RKNEN7_MASK          (0x80U)
#define VFCCU_3_FHIMRKC0_00_RKNEN7_SHIFT         (7U)
#define VFCCU_3_FHIMRKC0_00_RKNEN7_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_00_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_00_RKNEN7_SHIFT)) & VFCCU_3_FHIMRKC0_00_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_10 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_3_FHIMRKC0_10_RKNEN0_MASK          (0x1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN0_SHIFT         (0U)
#define VFCCU_3_FHIMRKC0_10_RKNEN0_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN0_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN0_MASK)

#define VFCCU_3_FHIMRKC0_10_RKNEN1_MASK          (0x2U)
#define VFCCU_3_FHIMRKC0_10_RKNEN1_SHIFT         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN1_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN1_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN1_MASK)

