zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHIMRKC0_10_RKNEN2_MASK          (0x4U)
#define VFCCU_3_FHIMRKC0_10_RKNEN2_SHIFT         (2U)
#define VFCCU_3_FHIMRKC0_10_RKNEN2_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN2_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN2_MASK)

#define VFCCU_3_FHIMRKC0_10_RKNEN3_MASK          (0x8U)
#define VFCCU_3_FHIMRKC0_10_RKNEN3_SHIFT         (3U)
#define VFCCU_3_FHIMRKC0_10_RKNEN3_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN3_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN3_MASK)

#define VFCCU_3_FHIMRKC0_10_RKNEN4_MASK          (0x10U)
#define VFCCU_3_FHIMRKC0_10_RKNEN4_SHIFT         (4U)
#define VFCCU_3_FHIMRKC0_10_RKNEN4_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN4_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN4_MASK)

#define VFCCU_3_FHIMRKC0_10_RKNEN5_MASK          (0x20U)
#define VFCCU_3_FHIMRKC0_10_RKNEN5_SHIFT         (5U)
#define VFCCU_3_FHIMRKC0_10_RKNEN5_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN5_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN5_MASK)

#define VFCCU_3_FHIMRKC0_10_RKNEN6_MASK          (0x40U)
#define VFCCU_3_FHIMRKC0_10_RKNEN6_SHIFT         (6U)
#define VFCCU_3_FHIMRKC0_10_RKNEN6_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN6_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN6_MASK)

#define VFCCU_3_FHIMRKC0_10_RKNEN7_MASK          (0x80U)
#define VFCCU_3_FHIMRKC0_10_RKNEN7_SHIFT         (7U)
#define VFCCU_3_FHIMRKC0_10_RKNEN7_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_10_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_10_RKNEN7_SHIFT)) & VFCCU_3_FHIMRKC0_10_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_20 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_3_FHIMRKC0_20_RKNEN0_MASK          (0x1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN0_SHIFT         (0U)
#define VFCCU_3_FHIMRKC0_20_RKNEN0_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN0_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN0_MASK)

#define VFCCU_3_FHIMRKC0_20_RKNEN1_MASK          (0x2U)
#define VFCCU_3_FHIMRKC0_20_RKNEN1_SHIFT         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN1_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN1_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN1_MASK)

#define VFCCU_3_FHIMRKC0_20_RKNEN2_MASK          (0x4U)
#define VFCCU_3_FHIMRKC0_20_RKNEN2_SHIFT         (2U)
#define VFCCU_3_FHIMRKC0_20_RKNEN2_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN2_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN2_MASK)

#define VFCCU_3_FHIMRKC0_20_RKNEN3_MASK          (0x8U)
#define VFCCU_3_FHIMRKC0_20_RKNEN3_SHIFT         (3U)
#define VFCCU_3_FHIMRKC0_20_RKNEN3_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN3_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN3_MASK)

#define VFCCU_3_FHIMRKC0_20_RKNEN4_MASK          (0x10U)
#define VFCCU_3_FHIMRKC0_20_RKNEN4_SHIFT         (4U)
#define VFCCU_3_FHIMRKC0_20_RKNEN4_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN4_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN4_MASK)

#define VFCCU_3_FHIMRKC0_20_RKNEN5_MASK          (0x20U)
#define VFCCU_3_FHIMRKC0_20_RKNEN5_SHIFT         (5U)
#define VFCCU_3_FHIMRKC0_20_RKNEN5_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN5_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN5_MASK)

#define VFCCU_3_FHIMRKC0_20_RKNEN6_MASK          (0x40U)
#define VFCCU_3_FHIMRKC0_20_RKNEN6_SHIFT         (6U)
#define VFCCU_3_FHIMRKC0_20_RKNEN6_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN6_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN6_MASK)

#define VFCCU_3_FHIMRKC0_20_RKNEN7_MASK          (0x80U)
#define VFCCU_3_FHIMRKC0_20_RKNEN7_SHIFT         (7U)
#define VFCCU_3_FHIMRKC0_20_RKNEN7_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_20_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_20_RKNEN7_SHIFT)) & VFCCU_3_FHIMRKC0_20_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_30 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_3_FHIMRKC0_30_RKNEN0_MASK          (0x1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN0_SHIFT         (0U)
#define VFCCU_3_FHIMRKC0_30_RKNEN0_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN0_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN0_MASK)

#define VFCCU_3_FHIMRKC0_30_RKNEN1_MASK          (0x2U)
#define VFCCU_3_FHIMRKC0_30_RKNEN1_SHIFT         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN1_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN1_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN1_MASK)

#define VFCCU_3_FHIMRKC0_30_RKNEN2_MASK          (0x4U)
#define VFCCU_3_FHIMRKC0_30_RKNEN2_SHIFT         (2U)
#define VFCCU_3_FHIMRKC0_30_RKNEN2_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN2_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN2_MASK)

#define VFCCU_3_FHIMRKC0_30_RKNEN3_MASK          (0x8U)
#define VFCCU_3_FHIMRKC0_30_RKNEN3_SHIFT         (3U)
#define VFCCU_3_FHIMRKC0_30_RKNEN3_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN3_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN3_MASK)

#define VFCCU_3_FHIMRKC0_30_RKNEN4_MASK          (0x10U)
#define VFCCU_3_FHIMRKC0_30_RKNEN4_SHIFT         (4U)
#define VFCCU_3_FHIMRKC0_30_RKNEN4_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN4_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN4_MASK)

#define VFCCU_3_FHIMRKC0_30_RKNEN5_MASK          (0x20U)
#define VFCCU_3_FHIMRKC0_30_RKNEN5_SHIFT         (5U)
#define VFCCU_3_FHIMRKC0_30_RKNEN5_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN5_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN5_MASK)

