zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_3.h
#define VFCCU_3_FHIMRKC0_30_RKNEN6_MASK          (0x40U)
#define VFCCU_3_FHIMRKC0_30_RKNEN6_SHIFT         (6U)
#define VFCCU_3_FHIMRKC0_30_RKNEN6_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN6_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN6_MASK)

#define VFCCU_3_FHIMRKC0_30_RKNEN7_MASK          (0x80U)
#define VFCCU_3_FHIMRKC0_30_RKNEN7_SHIFT         (7U)
#define VFCCU_3_FHIMRKC0_30_RKNEN7_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_30_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_30_RKNEN7_SHIFT)) & VFCCU_3_FHIMRKC0_30_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_40 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_3_FHIMRKC0_40_RKNEN0_MASK          (0x1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN0_SHIFT         (0U)
#define VFCCU_3_FHIMRKC0_40_RKNEN0_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN0_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN0_MASK)

#define VFCCU_3_FHIMRKC0_40_RKNEN1_MASK          (0x2U)
#define VFCCU_3_FHIMRKC0_40_RKNEN1_SHIFT         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN1_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN1_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN1_MASK)

#define VFCCU_3_FHIMRKC0_40_RKNEN2_MASK          (0x4U)
#define VFCCU_3_FHIMRKC0_40_RKNEN2_SHIFT         (2U)
#define VFCCU_3_FHIMRKC0_40_RKNEN2_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN2_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN2_MASK)

#define VFCCU_3_FHIMRKC0_40_RKNEN3_MASK          (0x8U)
#define VFCCU_3_FHIMRKC0_40_RKNEN3_SHIFT         (3U)
#define VFCCU_3_FHIMRKC0_40_RKNEN3_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN3_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN3_MASK)

#define VFCCU_3_FHIMRKC0_40_RKNEN4_MASK          (0x10U)
#define VFCCU_3_FHIMRKC0_40_RKNEN4_SHIFT         (4U)
#define VFCCU_3_FHIMRKC0_40_RKNEN4_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN4_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN4_MASK)

#define VFCCU_3_FHIMRKC0_40_RKNEN5_MASK          (0x20U)
#define VFCCU_3_FHIMRKC0_40_RKNEN5_SHIFT         (5U)
#define VFCCU_3_FHIMRKC0_40_RKNEN5_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN5_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN5_MASK)

#define VFCCU_3_FHIMRKC0_40_RKNEN6_MASK          (0x40U)
#define VFCCU_3_FHIMRKC0_40_RKNEN6_SHIFT         (6U)
#define VFCCU_3_FHIMRKC0_40_RKNEN6_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN6_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN6_MASK)

#define VFCCU_3_FHIMRKC0_40_RKNEN7_MASK          (0x80U)
#define VFCCU_3_FHIMRKC0_40_RKNEN7_SHIFT         (7U)
#define VFCCU_3_FHIMRKC0_40_RKNEN7_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_40_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_40_RKNEN7_SHIFT)) & VFCCU_3_FHIMRKC0_40_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_50 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_3_FHIMRKC0_50_RKNEN0_MASK          (0x1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN0_SHIFT         (0U)
#define VFCCU_3_FHIMRKC0_50_RKNEN0_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN0_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN0_MASK)

#define VFCCU_3_FHIMRKC0_50_RKNEN1_MASK          (0x2U)
#define VFCCU_3_FHIMRKC0_50_RKNEN1_SHIFT         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN1_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN1_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN1_MASK)

#define VFCCU_3_FHIMRKC0_50_RKNEN2_MASK          (0x4U)
#define VFCCU_3_FHIMRKC0_50_RKNEN2_SHIFT         (2U)
#define VFCCU_3_FHIMRKC0_50_RKNEN2_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN2_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN2_MASK)

#define VFCCU_3_FHIMRKC0_50_RKNEN3_MASK          (0x8U)
#define VFCCU_3_FHIMRKC0_50_RKNEN3_SHIFT         (3U)
#define VFCCU_3_FHIMRKC0_50_RKNEN3_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN3_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN3_MASK)

#define VFCCU_3_FHIMRKC0_50_RKNEN4_MASK          (0x10U)
#define VFCCU_3_FHIMRKC0_50_RKNEN4_SHIFT         (4U)
#define VFCCU_3_FHIMRKC0_50_RKNEN4_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN4_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN4_MASK)

#define VFCCU_3_FHIMRKC0_50_RKNEN5_MASK          (0x20U)
#define VFCCU_3_FHIMRKC0_50_RKNEN5_SHIFT         (5U)
#define VFCCU_3_FHIMRKC0_50_RKNEN5_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN5_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN5_MASK)

#define VFCCU_3_FHIMRKC0_50_RKNEN6_MASK          (0x40U)
#define VFCCU_3_FHIMRKC0_50_RKNEN6_SHIFT         (6U)
#define VFCCU_3_FHIMRKC0_50_RKNEN6_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN6_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN6_MASK)

#define VFCCU_3_FHIMRKC0_50_RKNEN7_MASK          (0x80U)
#define VFCCU_3_FHIMRKC0_50_RKNEN7_SHIFT         (7U)
#define VFCCU_3_FHIMRKC0_50_RKNEN7_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_50_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_50_RKNEN7_SHIFT)) & VFCCU_3_FHIMRKC0_50_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_60 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_3_FHIMRKC0_60_RKNEN0_MASK          (0x1U)
#define VFCCU_3_FHIMRKC0_60_RKNEN0_SHIFT         (0U)
#define VFCCU_3_FHIMRKC0_60_RKNEN0_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_60_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_60_RKNEN0_SHIFT)) & VFCCU_3_FHIMRKC0_60_RKNEN0_MASK)

#define VFCCU_3_FHIMRKC0_60_RKNEN1_MASK          (0x2U)
#define VFCCU_3_FHIMRKC0_60_RKNEN1_SHIFT         (1U)
#define VFCCU_3_FHIMRKC0_60_RKNEN1_WIDTH         (1U)
#define VFCCU_3_FHIMRKC0_60_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_3_FHIMRKC0_60_RKNEN1_SHIFT)) & VFCCU_3_FHIMRKC0_60_RKNEN1_MASK)

